# Transforming strings input into Datetime values

### Time is important for time series

### transforming a dataframe into time series

# <br><br><br><br>

# Importing packages

In [1]:
import numpy as np
import pandas as pd

# importing the data

In [3]:
data  = pd.read_csv("Index2018.csv")

In [4]:
df_comp = data.copy()

## Transforming date column into datetype

In [5]:
df_comp.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

### since the date column is not umeric python does not summerise statistic of date column

In [6]:
df_comp.date.describe()

count           6269
unique          6269
top       16/09/2005
freq               1
Name: date, dtype: object

### it is completely arbitary
### it doesn't provided min max and others statistics
### All the date value are 1
### Any single data holds a top value
### The method randomly select one to display

### we need to fix this

## we can fix by converting date into datetime objects<br><br><br><br><br><br><br><br><br>
## from text to date

In [10]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst=True) ### assumes we are plugging a string in a mm/dd/yyyy form

In [11]:
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [12]:
data.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [16]:
df_comp.date.describe() #here we can see after converting into datetime obj we are getting more infromation

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

# <br>

## *setting index

#### how set any atribute of dataframe as an index

## In time series analysis

### --Each value should correspond to a time period
### --we often wish to examine specific chunk of data between two concret date
### --Seperating the data before and after september 20 2009
### --We need to use associated time periods as indices<br><br>
### here we are converting datetime into index because all other column would utomatically become time series, since there is time period attached to each value

In [17]:
df_comp.set_index("date", inplace=True)

In [18]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### now here our date column has been converted into indexe<br>
### once "date" became an indexe we no longer save it's value as a seprate attribute in the dataframe

In [19]:
df_comp.date.describe()

AttributeError: 'DataFrame' object has no attribute 'date'

# *setting desired frequency

## .asfreq()<br><br>
### The values this argument can take are specific latters of the alphabtes
###  'h'- Hourly
###  'w'- weekly
###  'd'- daily
###  'm'-monthly<br>

### data measured once per year is annual , rather than yearly, so we use 'a' instead of 'y'

In [20]:
df_comp = df_comp.asfreq("d")

In [21]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

### we can see two data set with missing value jan 8th and 9th , this because of jan 8 is saturday and jan 9 is sunday
### saturday sunday is not business date

### here we generated new periods which do nat have value assiciated with them <br><br>
### closing prices of financial indices 
### can only be recorded during working days
### Not intrested in any weekends or holidays

In [22]:
# we can set frequency as BUSINESS DATE

In [23]:
df_comp = df_comp.asfreq("b")

In [24]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

## * Handling missing value

###  "isna()"<br>

###  true    - mssing value for the period
###  False   - no missing value for the period

In [25]:
df_comp.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

#### The bigger the dataset the more difficult it become to spot missing values

### it will take time to analyse missing data
### in python 1=True and 0=false

In [26]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [27]:
# setting the frequency to business date must have generated 8 dates for which we have no data availbale

#### we can handel this missing data by ysinh "fillna()" method

### fillna() method<br><br><br>
#### 1) Front filling = assign the value of previous period
#### 1) Back filling = assign the value of next period
#### 1) assigning the same value = assign the average to all missing value within the time series<br><br><br>

In [29]:
df_comp.spx = df_comp.spx.fillna(method = "ffill") #front filling

In [30]:
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [31]:
df_comp.ftse = df_comp.ftse.fillna(method = "bfill") #front filling

In [32]:
df_comp.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [34]:
df_comp.dax = df_comp.dax.fillna(value = df_comp.dax.mean()) #front filling

In [35]:
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [36]:
#df_comp.nikkei = df_comp.nikkei.fillna(method = "bfill") #front filling

### front filling copies the last known value where as backfilling uses the next known value

# <br><br><br><br>

# *simpplifying(adding and removing column in dataset) the dataset